# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'

# Binaries
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'gnupg'
brew 'grep'
brew 'httpie'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'svn' # Needed to install fonts
brew 'pkg-config'

# Development
brew 'node'
brew 'yarn'
brew 'pnpm'

# Apps
cask 'google-chrome'
cask 'firefox'
cask 'iterm2'
cask 'visual-studio-code'
cask 'tableplus'
cask 'figma'
cask 'slack'
cask 'discord'
cask 'alfred'
cask 'kawa'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'Magnet', id: 441258766
mas 'Trello: organize anything!', id: 461504587
